nc: 3  # number of classes
scales:
  n: [0.33, 0.50, 1024]
fusion_mode: adaptive
node_mode: FasterCSP
head_channel: 256
backbone:
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, FasterCSP, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, FasterCSP, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, FasterCSP, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, FasterCSP, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 9

head:
  - [4, 1, Conv, [head_channel]]  # 10-P3/8
  - [6, 1, Conv, [head_channel]]  # 11-P4/16
  - [9, 1, Conv, [head_channel]]  # 12-P5/32

  - [11, 1, nn.Upsample, [None, 2, 'nearest']] # 13
  - [[-1, 10], 1, Fusion, [fusion_mode]] # 14
  - [-1, 3, node_mode, [head_channel]] # 15

  - [10, 1, Conv, [head_channel, 3, 2]] # 16
  - [15, 1, Conv, [head_channel, 3, 2]] # 17
  - [12, 1, nn.Upsample, [None, 2, 'nearest']] # 18
  - [[-1, 11, 16, 17], 1, Fusion, [fusion_mode]] # 19
  - [-1, 3, node_mode, [head_channel]] # 20
  - [11, 1, Conv, [head_channel, 3, 2]] # 21
  - [20, 1, Conv, [head_channel, 3, 2]] # # 22
  - [[-1, 12, 21], 1, Fusion, [fusion_mode]] # 23
  - [-1, 3, node_mode, [head_channel]] # 24
  - [20, 1, nn.Upsample, [None, 2, 'nearest']] # 25
  - [[-1, 10, 15], 1, Fusion, [fusion_mode]] # 26
  - [-1, 3, node_mode, [head_channel]] # 27
  - [15, 1, Conv, [head_channel, 3, 2]] # 28
  - [27, 1, Conv, [head_channel, 3, 2]] # 29
  - [24, 1, nn.Upsample, [None, 2, 'nearest']] # 30
  - [[-1 , 11, 20 ,28, 29], 1, Fusion, [fusion_mode]] # 31
  - [-1, 3, node_mode, [head_channel]] # 32
  - [20, 1, Conv, [head_channel, 3, 2]] # 33
  - [32, 1, Conv, [head_channel, 3, 2]] # 34
  - [[-1, 12, 29, 33], 1, Fusion, [fusion_mode]] # 35
  - [-1, 3, node_mode, [head_channel]] # 36

  - [[27, 32, 36], 1, Detect, [nc]]  # Detect(P3, P4, P5)

